'''Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.'''

# ------------------------------------------ Словарь ----------------------------------------------------
month = int(input('Введите порядковый номер месяца: '))

seasons = {
    1: 'зима',
    2: 'зима',
    12: 'зима',
    3: 'весна',
    4: 'весна',
    5: 'весна',
    6: 'лето',
    7: 'лето',
    8: 'лето',
    9: 'осень',
    10: 'осень',
    11: 'осень'
}
print(seasons.get(month))
# ----------------------------------------- Словарь -----------------------------------------------------

seasons = {
    'зима': [1, 2, 12],
    'весна': [3, 4, 5],
    'лето': [6, 7, 8],
    'осень': [9, 10, 11],
}
month = int(input('Введите порядковый номер месяца: '))
for key in seasons.keys():
    if month in seasons[key]:
        print(key)
# ------------------------------------------ Список ----------------------------------------------------
seasons = ['зима', 'весна', 'лето', 'осень']
month = int(input('Введите порядковый номер месяца: '))
if month == 12 or month == 1 or month == 2:
    print(seasons[0])
elif month == 3 or month == 4 or month == 5:
    print(seasons[1])
elif month == 6 or month == 7 or month == 8:
    print(seasons[2])
elif month == 9 or month == 10 or month == 11:
    print(seasons[3])
else:
    print('Такого месяца нет, проверьте правильность ввода!')